In [1]:
import pandas as pd
df=pd.read_excel("Sus.xlsx")
df

     Name  Class  Roll Adress
0   Simon     12    43    Ktm
1  Srijan     13     7    Bkt
2  Subash     14    78    Skt
3   Suman     15     2     Pu
4  Sushil      8    14    Ktm
5   Shyan     11    36     Su

In [2]:

df.set_index('Name',inplace=True)

In [3]:
df

        Class  Roll Adress
Name
Simon      12    43    Ktm
Srijan     13     7    Bkt
Subash     14    78    Skt
Suman      15     2     Pu
Sushil      8    14    Ktm
Shyan      11    36     Su

In [4]:
df.loc["Srijan"]

Class      13
Roll        7
Adress    Bkt
Name: Srijan, dtype: object